//: [Previous](@previous)

import Foundation

var greeting = "Hello, playground"


/*
 
 1. Напишите функцию, которая принимает опциональный String и выводит его содержимое, используя if let и guard let.
 2. Напишите функцию, которая принимает массив опциональных чисел и возвращает новый массив с не опциональными значениями.
 3. Создайте функцию, которая сравнивает два опциональных значения. Учтите случаи с nil.
 4. Напишите функцию, которая принимает два опциональных замыкания и вызывает ненулевое если оно есть.
 5. Реализуйте функцию, которая безопасно извлекает элемент из массива по индексу, возвращая опциональное значение.
 
 */



//: [Next](@next)
