//: [Previous](@previous)
/*
 
 
 ### Точки с запятой
 1. Напишите две инструкции в одной строке, разделив их точкой с запятой.
 2. Напишите инструкцию без точки с запятой.
 
 ### Опциональные типы
 1. Распакуйте опциональное значение с проверкой `if let`.
 2. Используйте `guard` для распаковки опционала.
 
 ### Кортежи
 1. Создайте кортеж для хранения информации о студенте (имя, возраст, средний балл).
 2. Распакуйте кортеж в переменные.
 
 ### Псевдонимы типов (typealias)
 1. Создайте псевдоним для `Int`.
 2. Создайте псевдоним для кортежа, представляющего координаты точки.
 
 */

//: [Next](@next)
