//: [Previous](@previous)
/*
 
 ### Тернарный оператор `?:`
 1. **Минимум из двух чисел**: Найдите минимальное из двух чисел без использования `if`.
 2. **Строковый регистр**: Преобразуйте строку в верхний регистр, если она короче 5 символов, иначе в нижний.
 
 ### Оператор выбора `switch`
 1. **Дни недели**: Выведите название дня недели по его номеру.
 2. **Оценки**: Преобразуйте числовую оценку в буквенную (A, B, C, D, F).
 
 ### Операторы `while`, `repeat-while`
 1. **Сумма чисел**: Найдите сумму чисел от 1 до N.
 2. **Поиск делителя**: Найдите первый делитель числа, отличный от 1 и самого числа.
 
 */
//: [Next](@next)
