//: [Previous](@previous)

import Foundation

var greeting = "Hello, playground"


/*
 
 Классы:
 
 1. Создайте класс Person, который содержит свойства name, age, gender. Определите значения по умолчанию для некоторых из свойств. Добавить инициализатор. Класс так же должен содержать метод getDescription, который возвращает предложение со всей информацией о персоне. Создайте экземпляр класса, и задайте конкретные значения для свойств. Отобразите результат работы метода getDescription на консоли.
 
 2. Создайте класс BankAccount, который будет содержать свойства balance и accountNumber. Создайте методы increaseDeposit и withdrawMoney, первый будет добавлять к балансу какую-то сумму, а второй уменьшать ее. Добавить инициализатор. Добавить вычисляемые свойство getDescription для получения описания объекта.
 
 */

/*
 Структуры:
 
 Задача 1: Мутирование структуры
 Создайте структуру Smartphone, которая имеет свойства:
 batteryLevel и isSilentModeOn.
 Добавьте метод toggleSilentMode, который переключает режим "Тихий".
 
 Задача 2: Использование willSet и didSet
 Добавьте в структуру Smartphone свойство batteryStatus,
 которое будет обновляться в зависимости от уровня заряда батареи.
 
 Задача 3: Использование get и set
 Добавьте свойство screenTimeout,
 которое можно будет изменять через свойство screenTimeoutMinutes.
 
 */






//: [Next](@next)
