//: [Previous](@previous)

import Foundation

/*
 Множества:
 1. Уникальные элементы: Напишите программу, которая принимает массив и возвращает множество из уникальных элементов этого массива.
 2. Подмножества: Напишите программу, которая проверяет, является ли одно множество подмножеством другого.
 3. Объединение множеств: Создайте два множества и найдите их объединение.
 4. Разность множеств: Создайте два множества и найдите разность между ними (т.е. элементы, которые есть в первом множестве, но нет во втором).
 5. Создайте два множества и найдите их пересечение.
 */


//: [Next](@next)
